wisteria-1c/Конфигурация/Documents/СверкаВзаиморасчетовСБПc2b.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>СверкаВзаиморасчетовСБПc2b</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НастройкаПодключения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиПодключенияКСистемеБыстрыхПлатежей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаОплат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВозвратов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаКомиссии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проверена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписаниеРасходов</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СписаниеРасходовСБП</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>140</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостояниеСверкиВзаиморасчетовСБПc2b</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаОплатКорректна</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВозвратовКорректна</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗапросаСтатуса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

wisteria-1c/Конфигурация/Documents/СверкаВзаиморасчетовСБПc2b/Forms/ФормаДокумента/Ext/Form/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Настройки = СверкаВзаиморасчетовСБПc2b.НастройкеСверкиВзаиморасчетов();
	Элементы.ГруппаСтраницы.Видимость = Настройки.ИспользоватьСписаниеРасходов;
	СуммаКомиссииНеРассчитана = НСтр("ru = 'Сумма комиссии не рассчитана'");
	
	УстановитьОформление();
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если ТекущийОбъект.Состояние <> Перечисления.СостояниеСверкиВзаиморасчетовСБПc2b.Подготовлена Тогда
		ВызватьИсключение НСтр("ru = 'Некорректные параметры формы.'");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СписатьКомиссию(Команда)
	
	СписатьКомиссиюНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СверкаПоОперациям(Команда)
	
	Отбор = Новый Структура;
	Отбор.Вставить("СверкаВзаиморасчетов", Объект.Ссылка);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
	ПараметрыФормы.Вставить("Отбор",                   Отбор);
	
	ОткрытьФорму(
		"Отчет.СверкаОперацийСБПc2b.ФормаОбъекта",
		ПараметрыФормы,
		ЭтотОбъект,
		УникальныйИдентификатор);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьОформление()
	
	Если ИнтернетПоддержкаПользователейКлиентСервер.ЭтоПлатформа85() Тогда
		Если Объект.СуммаОплатКорректна Тогда
			Элементы.СуммаОплат.ЦветРамки = ЦветаПалитры.Зеленый;
		Иначе
			Элементы.СуммаОплат.ЦветРамки = ЦветаПалитры.Красный;
		КонецЕсли;
		
		Если Объект.СуммаВозвратовКорректна Тогда
			Элементы.СуммаВозвратов.ЦветРамки = ЦветаПалитры.Зеленый;
		Иначе
			Элементы.СуммаВозвратов.ЦветРамки = ЦветаПалитры.Красный;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьДоступность()
	
	Элементы.ГруппаСуммаКомиссии.ТекущаяСтраница = ?(
		ЗначениеЗаполнено(Объект.СуммаКомиссии),
		Элементы.ГруппаСуммаКомиссииЗначение,
		Элементы.ГруппаСуммаКомиссииНеРассчитана);
	Элементы.ГруппаСтраницы.ТекущаяСтраница = ?(
		ЗначениеЗаполнено(Объект.СписаниеРасходов),
		Элементы.ГруппаСписаниеРасходов,
		Элементы.ГруппаСписатьКомиссию);
	
	Если Объект.СуммаВозвратовКорректна И Объект.СуммаОплатКорректна Тогда
		УстановитьОтображениеРезультатаСверки(
			Ложь,
			НСтр("ru = 'Сверка взаиморасчетов успешно выполнена, расхождений не обнаружено.'"));
	Иначе
		Если Не Объект.СуммаВозвратовКорректна И Не Объект.СуммаОплатКорректна Тогда
			УстановитьОтображениеРезультатаСверки(
				Истина,
				НСтр("ru = 'Сверка взаиморасчетов выполнена, обнаружены расхождения в сумме оплат и возвратов.
					|Выполните сверку операций для анализа расхождений.'"));
		Иначе
			УстановитьОтображениеРезультатаСверки(
				Истина,
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Сверка взаиморасчетов выполнена, обнаружены расхождения в сумме %1.
						|Выполните сверку операций для анализа расхождений.'"),
					?(Не Объект.СуммаОплатКорректна,
						НСтр("ru = 'оплат'"),
						НСтр("ru = 'возвратов'"))));
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СписатьКомиссиюНаСервере()
	
	Объект.СписаниеРасходов = СверкаВзаиморасчетовСБПc2b.СлужебнаяСписанииРасходовКомиссии(
		Объект.НастройкаПодключения,
		Объект.НачалоПериода,
		Объект.КонецПериода,
		Объект.СуммаКомиссии);
	
	Записать();
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтображениеРезультатаСверки(Предупреждение, ТекстНадписи)
	
	ПараметрыСообщения = ОбщегоНазначения.ПараметрыВажногоСообщения();
	ПараметрыСообщения.Сообщение = ТекстНадписи;
	ПараметрыСообщения.Скрываемый = Ложь;
	ПараметрыСообщения.Идентификатор = "СтатусСверки";
	
	ПараметрыСообщения.КраткоеПредставление = ?(
		Предупреждение,
		НСтр("ru = 'Обнаружены расхождения.'"),
		НСтр("ru = 'Сверка успешно выполнена'"));
	ПараметрыСообщения.ТипСообщения = ?(
		Предупреждение,
		"Предупреждение",
		"Успех");
	
	ОбщегоНазначения.ВставитьВажноеСообщение(
		ЭтотОбъект,
		ПараметрыСообщения,
		Элементы.ГруппаПредставлениеРезультата.Имя);
	ОбщегоНазначения.ВывестиСтатусыИВажныеСообщенияНаФорму(
		ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти
